logs/benchmark_20250709_202127/h2_100ms_1pct.log
=== HTTP/2 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-09 20:25:00
Delay: 100ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 2000 total requests
spawning thread #1: 5 total client(s). 2000 total requests
spawning thread #2: 5 total client(s). 2000 total requests
spawning thread #3: 5 total client(s). 2000 total requests
spawning thread #4: 5 total client(s). 2000 total requests
spawning thread #5: 5 total client(s). 2000 total requests
spawning thread #6: 5 total client(s). 2000 total requests
spawning thread #7: 5 total client(s). 2000 total requests
spawning thread #8: 5 total client(s). 2000 total requests
spawning thread #9: 5 total client(s). 2000 total requests
spawning thread #10: 5 total client(s). 2000 total requests
spawning thread #11: 5 total client(s). 2000 total requests
spawning thread #12: 5 total client(s). 2000 total requests
spawning thread #13: 5 total client(s). 2000 total requests
spawning thread #14: 5 total client(s). 2000 total requests
spawning thread #15: 5 total client(s). 2000 total requests
spawning thread #16: 5 total client(s). 2000 total requests
spawning thread #17: 5 total client(s). 2000 total requests
spawning thread #18: 5 total client(s). 2000 total requests
spawning thread #19: 5 total client(s). 2000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 475.36ms, 84146.93 req/s, 24.40MB/s
requests: 40000 total, 40000 started, 40000 done, 40000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 40000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 11.60MB (12162375) total, 8.12MB (8517709) headers (space savings 27.82%), 2.29MB (2400000) data
                     min         max         mean         sd        +/- sd
time for request:      993us    101.59ms     86.78ms     19.53ms    92.50%
time for connect:     1.47ms     98.51ms     48.72ms     27.17ms    57.00%
time to 1st byte:    22.94ms    196.92ms    120.75ms     52.86ms    58.00%
req/s           :     851.33     2814.57     1037.21      226.22    91.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 18000 total requests
spawning thread #1: 5 total client(s). 18000 total requests
spawning thread #2: 5 total client(s). 18000 total requests
spawning thread #3: 5 total client(s). 18000 total requests
spawning thread #4: 5 total client(s). 18000 total requests
spawning thread #5: 5 total client(s). 18000 total requests
spawning thread #6: 5 total client(s). 18000 total requests
spawning thread #7: 5 total client(s). 18000 total requests
spawning thread #8: 5 total client(s). 18000 total requests
spawning thread #9: 5 total client(s). 18000 total requests
spawning thread #10: 5 total client(s). 18000 total requests
spawning thread #11: 5 total client(s). 18000 total requests
spawning thread #12: 5 total client(s). 18000 total requests
spawning thread #13: 5 total client(s). 18000 total requests
spawning thread #14: 5 total client(s). 18000 total requests
spawning thread #15: 5 total client(s). 18000 total requests
spawning thread #16: 5 total client(s). 18000 total requests
spawning thread #17: 5 total client(s). 18000 total requests
spawning thread #18: 5 total client(s). 18000 total requests
spawning thread #19: 5 total client(s). 18000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 25.51s, 14111.51 req/s, 4.10MB/s
requests: 360000 total, 360000 started, 360000 done, 360000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 360000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 104.54MB (109614375) total, 73.29MB (76849475) headers (space savings 27.78%), 20.60MB (21600000) data
                     min         max         mean         sd        +/- sd
time for request:      416us       1.34s    355.91ms    215.09ms    61.74%
time for connect:     2.88ms    100.59ms     50.90ms     28.85ms    54.00%
time to 1st byte:    19.14ms    694.38ms    336.99ms    206.05ms    55.00%
req/s           :     141.12      146.17      141.50        0.63    95.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/2
Fair Comparison: Enabled
Warmup Requests: 40000
Measurement Requests: 360000
End Time: 2025-07-09 20:25:31
CSV Log: /logs/benchmark_20250709_202127/h2_100ms_1pct.csv